package main

import "fmt"

//Дана последовательность температурных колебаний:
//-25.4, -27.0 13.0, 19.0, 15.5, 24.5, -21.0, 32.5.
//Объединить данные значения в группы с шагом в 10 градусов.
//Последовательность в подмножноствах не важна.
//
//
//Пример: -20:{-25.0, -27.0, -21.0}, 10:{13.0, 19.0, 15.5}, 20: {24.5}, etc

func main() {
	arr := []float32{-25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5}
	answer := make(map[int][]float32)
	var toInt int
	for _, i := range arr {
		toInt = int(i)
		answer[(toInt/10)*10] = append(answer[(toInt/10)*10], i)
	}
	fmt.Println(answer)
}
